openfoam_cases/damBreak_MM_a2250/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  project site
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    rightWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    lowerWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    atmosphere
    {
        type            prghTotalPressure;
        p0              $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
